* Org mode table example summing columns by nane

| WHAT  | Thing1 Name | Thing1 Name | Thing3 Name |
|-------+-------------+-------------+-------------|
| Foo   |           1 |           2 |           3 |
| Bar   |           4 |           5 |           6 |
| Baz   |           7 |           8 |          42 |
|-------+-------------+-------------+-------------|
| Total |          12 |          15 |          51 |
| ^     |      Thing1 |      Thing2 |      Thing3 |
#+TBLFM: $Thing1=vsum(@2..@-1)
#+TBLFM: $Thing2=vsum(@2..@-1)::$Thing3=vsum(@2..@-1)::
